[
  {
    "id": 1,
    "title": "Alpine Lake Trout",
    "description": "Alpine Lakes trout are an interesting and rewarding fishery, not always guaranteed with big fish, but always great views. The biggest trout are found in lakes with sparse amounts of fish, stocked around 3-4 years ago. Unfortunately, no alpine lakes have been stocked since 2017, so most of the stocked fish should be dead now. The other option is naturally reproducing lakes, where trout are able to spawn offspring. These lakes often have abundant, smaller fish. There are even lakes listed as \"overpopulated\" by the WDFW, with so many fish they are overpopulated. These lakes are good to start with, as they have plenty of fish to catch, although they won't be as big. For larger fish, lakes on the east side of the Cascades tend to have bigger fish.",
    "fish_types": ["Rainbow Trout", "Brown Trout", "Cutthroat Trout", "Golden Trout"],
    "fish_category": "Trout",
    "locations": ["Alpine Lakes Wilderness"],
    "months": ["June", "July", "August", "September"],
    "date_posted": "03-15-2024",
    "image": "images/alpine_lakes_trout.jpg",
    "image_credit": "Riptidefish"
  },
  {
    "id": 2,
    "title": "Puget Sound Squidding",
    "description": "Puget Sound has a abundant squid harvest each year, with a winter season in the Central Puget Sound. Easy access from piers near the city make it a popular pastime. People bring their own lights, and jig from a lit pier as well since light attracts squid. Nighttime is good but often the day is good too. People buy locally made jigs from fishermen on the piers, since the local squid prefer these special jigs. Jigging is easy with a rod, reel, and a squid jig, letting the jig fall for a few seconds before pulling up. Squids have a year life cycle so they are not prone to overfishing and reliably come back every year.",
    "fish_types": ["Squid"],
    "fish_category": "Squid",
    "locations": ["Edmonds Pier", "Alki Point", "Pier 70"],
    "months": ["September", "October", "November", "December", "January"],
    "date_posted": "01-05-2024",
    "image": "images/squid.jpg",
    "image_credit": "WDFW"
  },
  {
    "id": 3,
    "title": "Dungeness Crabs",
    "description": "Crabbing is a favorite pasttime for PNW resients, and it is not hard to catch them. Many locations have crabs, and they prefer sandy bottoms not too deep and preferably with eelgrass. Near rivers is often good too. A protected bay will prevent crab pots from floating away, and make sure the tides aren't rising too much or your pot could get pulled away.",
    "fish_types": ["Dungeness Crab"],
    "fish_category": "Crustacean",
    "locations": ["Alki Point", "Bainbridge Island", "Shoreline", "Browns Bay near Edmonds", "Guemes Island", "Cama Beach"],
    "months": ["June", "July", "August"],
    "date_posted": "01-05-2024",
    "image": "images/crab.jpg",
    "image_credit": "This is Whidbey"
  },
  {
    "id": 4, 
    "title": "Redtail Surf Perch",
    "description": "Redtail Surf Perch is available year round but some say it is best in the winter. You can catch them from shore from a variety of coastal beaches. They are certainly tasty with a white meat. Most people use waders to cast from around waist deep in the surf. However, you must be careful of the conditions, since high winds and waves will make wading in the surf dangerous.",
    "fish_types": ["Redtail Surf Perch"],
    "fish_category": "Perch",
    "locations": ["Pacific Beach State Park", "Mocrocks Beach", "Ruby Beach", "La Push Beach", "Long Beach"],
    "months": ["Janurary", "February", "March", "April", "May", "June", "July", "August"],
    "date_posted": "09-20-2023",
    "image": "images/Sea_Perch.jpg",
    "image_credit": "LeeRoy's Ramblings"
  },
  {
    "id": 5,
    "title": "Eulachon Smelt",
    "description": "Eulachon Smelt have signifcant historical significance, as a huge source of fish oil for PNW native tribes. The fish is so oily they would dry it and light it on fire as a candle, and extract vats of it for potlatch feasts. The fish stocks have suffered and now it is on the endangered species list in the Columbia River, so limited harvests allowed. Recently, one day seasons are the norm, in February or March. This occurs on the Cowlitz river, a tributary of the Columbia River. Interestingly, these are dip net seasons, where you use a net to catch the fish.",
    "fish_types": ["Eulachon Smelt"],
    "fish_category": "Smelt",
    "locations": ["Cowlitz River"],
    "months": ["February", "March"],
    "date_posted": "07-05-2021",
    "image": "images/eulachon.jpg",
    "image_credit": "Northwest Power and Conservation Council"
  },
  {
    "id": 6,
    "title": "Puget Sound Lingcod",
    "description": "Lingcod are a large bottom fish, similar flesh to halibut or cod. They are protected well by regulations, allowing you to only catch one per day from 26 to 36 inches. This means it is not hard to catch one every year. Lingcod love rocky areas so the rocky San Juans are perfect. You can fish with metal jigs like buzz bombs, or plastic jigs with a weight, or even live bait. There are lots of greenling around the San Juans that you can catch for bait.",
    "fish_types": ["Pacific Lingcod"],
    "fish_category": "Bottomfish",
    "locations": ["San Juan Islands", "Double Bluff on Whidbey Island", "Possesion Bar", "Deception Pass"],
    "months": ["May", "June"],
    "date_posted": "05-05-2021",
    "image": "images/lingcod.jpg",
    "image_credit": "Riptidefish"
  },
  {
    "id": 7,
    "title": "Columbia River Summer Steelhead",
    "description": "Not to be forgotten for the mightier salmon runs, the Columbia River also support a large run of summer steelhead. Steelhead are related to salmon, taste really good, and also migrate to and from the sea. While fishing for salmon anglers can also target  steelhead, since they overlap with salmon. Steelhead runs from July to October, overlapping with the summer and fall runs of salmon. Steelhead are caught from the bank most commonly by plunking, and from boats anchoring and letting out spinners.",
    "fish_types": ["Steelhead Trout"],
    "fish_category": "Trout",
    "locations": ["Lower Columbia River"],
    "months": ["July", "August", "October"],
    "date_posted": "06-15-2020",
    "image": "images/columbia_steelhead.webp",
    "image_credit": "Lance Fisher Fishing"
  },
  {
    "id": 8,
    "title": "Jetty Black Rockfish",
    "description": "Black Rockfish is a clean, mild tasting fish that suits cooking a variety of dishes. You can fish it off of a jetty with a swimbait lure and 9ft pole. You can also catch Lingcod with the same setup.",
    "fish_types": ["Black Rockfish"],
    "fish_category": "Rockfish",
    "locations": ["Ocean Shores Jetty", "Westport Jetty"],
    "months": ["March", "April", "May", "June", "July", "August"],
    "date_posted": "11-05-2019",
    "image": "images/sea_bass.jpg",
    "image_credit": "Riptidefish"
  },
  { 
    "id": 9,
    "title": "Puget Sound Coho Salmon",
    "description": "There are two runs of Coho in the Puget Sound. One is the resident Puget Sound population that opens for fishing in June or July, and continues until October. The other is the ocean-going population that migrates back from the ocean to the Puget Sound peaking in August and September. Combined, these two runs form an impressive fishery in August and September. Trolling from a boat or fishing from shore is both common. Shore fishing is done with a bobber and herring, or a metal jig.",
    "fish_types": ["Coho Salmon"],
    "fish_category": "Salmon",
    "locations": ["Bush Point", "Richmond Beach", "Point no Point", "West Point", "Point Wells and Oil Docks"],
    "months": ["June", "July", "August", "September"],
    "date_posted": "08-25-2016",
    "image": "images/coho.jpg",
    "image_credit": "Riptidefish"
  },
  {
    "id": 10,
    "title": "Columbia River Salmon",
    "description": "Down from a conservative estimate of 16 million annual salmon, around 2 million salmon return every year to the Columbia River. There are three seasons, with a modest spring season, a weak summer season, and a large fall season. In the spring from March to May, smaller chinooks can be had. In the summer season from June to July, the biggest Chinook historically come in, but most of them are extinct now. Sockeye also come in almost exclusively in this time. From August to October, a large run of Chinooks also come in high numbers and good sizes too. Cohos also come in these fall months exclusively. To catch these fish, bank fishing is done with a large surf rod and can be challenging to a novice. Charter boats that troll for Salmon are also very common, and even beginners enjoy success through them.",
    "fish_types": ["Chinook Salmon", "Sockeye Salmon", "Coho Salmon"],
    "fish_category": "Salmon",
    "locations": ["Lower Columbia River"],
    "months": ["March", "April", "May", "June", "July", "August", "September", "October"],
    "date_posted": "08-15-2015",
    "image": "images/columbia_salmon.jpg",
    "image_credit": "Terry Otto/The Columbian"
  },
  {
    "id": 11,
    "title": "Pink Salmon Bonanza",
    "description": "Bush point and Lincoln Park offer easy access and ample shore fishing for Pink Salmon, often covered with anglers getting their limit for the day. Anglers by far choose a pink buzz bomb lure to get the job done.",
    "fish_types": ["Pink Salmon"],
    "fish_category": "Salmon",
    "locations": ["Bush Point", "Lincoln Park"],
    "months": ["August"],
    "date_posted": "01-15-2012",
    "image": "images/pink_salmon.webp",
    "image_credit": "The Seattle Times"
  },
  {
    "id": 12,
    "title": "Winter Hatchery Steelhead",
    "description": "With regulations on keeping wild Steelhead, fishing abundant winter hatchery Steelhead is the best way to get a keeper. Steelhead migrate from the ocean to the river, and the best place to catch them is on rivers with large hatcheries, such as the Cowlitz. Anglers let a variety of lures drift downstream, wherever it is along the river bottom, through the water column, or floating with a bobber. Best conditions are when the water is neither high or low, with medium visibility that creates a famous \"Steelhead Green\" colored water.",
    "fish_types": ["Steelhead Trout"],
    "fish_category": "Trout",
    "locations": ["Cowlitz River", "Hoh River", "Kalama River", "Skykomish River"],
    "months": ["November", "December", "January"],
    "date_posted": "02-08-2011",
    "image": "images/steelhead.jpg",
    "image_credit": "Riptidefish"
  }  
]